src/cf/Catalogs/ДелаХраненияДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ДелаХраненияДокументов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДелоЗакрыто</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЛистов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоХраненияДел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХраненияДел</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатураДел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатураДел</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерТома</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЧасти</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьМестоХранения</Name>
					<Comment>Последняя актуальная версия 1.4.3</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаДокументов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыФормДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОтноситсяКНоменклатуреДел</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НоменклатураДел</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НоменклатураДел</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/ДелаХраненияДокументов/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ЗначениеЗаполнено(НомерТома) Или ЗначениеЗаполнено(НомерЧасти) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	Дела.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.ДелаХраненияДокументов КАК Дела
			|ГДЕ
			|	Дела.НоменклатураДел = &НоменклатураДел
			|	И Дела.НомерТома = &НомерТома
			|	И Дела.НомерЧасти = &НомерЧасти
			|	И Дела.Ссылка <> &Ссылка";
		
		Запрос.УстановитьПараметр("НомерТома", НомерТома);
		Запрос.УстановитьПараметр("НомерЧасти", НомерЧасти);
		Запрос.УстановитьПараметр("НоменклатураДел", НоменклатураДел);
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		Результат = Запрос.Выполнить();
		Если Не Результат.Пустой() Тогда
			ТекстТомаЧасти = НСтр("ru = 'тома'");
			Если ЗначениеЗаполнено(НомерЧасти) Тогда
				ТекстТомаЧасти = ?(ЗначениеЗаполнено(НомерТома),
					НСтр("ru = 'тома и части'"), НСтр("ru = 'части'"));
			КонецЕсли;
			ОбщегоНазначения.СообщитьПользователю(
				СтрШаблон(НСтр("ru = 'Дело с указанным номером %1 уже существует!'"), ТекстТомаЧасти), 
				ЭтотОбъект, ?(ЗначениеЗаполнено(НомерТома), "НомерТома", "НомерЧасти"),, Отказ);
			Возврат;	
		КонецЕсли;	
	КонецЕсли;
	
	Если ДелоЗакрыто Тогда 
		ПроверяемыеРеквизиты.Добавить("ДатаНачала");
		ПроверяемыеРеквизиты.Добавить("ДатаОкончания");
	КонецЕсли;	
	
	Если ПолучитьФункциональнуюОпцию("ОбязательныйУчетПоМестамХранения") Тогда 
		ПроверяемыеРеквизиты.Добавить("МестоХраненияДел");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДатаНачала) И ЗначениеЗаполнено(ДатаОкончания) 
		И ДатаНачала > ДатаОкончания Тогда 
		ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru = 'Дата окончания дела меньше, чем дата начала.'"),
			ЭтотОбъект,
			"ДатаОкончания",, 
			Отказ);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда 
		
		Если Не ДополнительныеСвойства.Свойство("ЗагрузкаИзДО20") Тогда 
			Возврат;
		КонецЕсли;	
		
	КонецЕсли;
	
	РеквизитыНоменклатурыДел = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(НоменклатураДел,
		"ПолноеНаименование, Организация, Раздел.Подразделение, ФормаДокументов");
	
	Если ДополнительныеСвойства.Свойство("ЗаголовокНоменклатурыСтарый") Тогда
		АвтоНаименованиеСтарое = ДелопроизводствоКлиентСервер.АвтоЗаголовокДела(
			ДополнительныеСвойства.ЗаголовокНоменклатурыСтарый, НомерТома, НомерЧасти);
		Если ПолноеНаименование = АвтоНаименованиеСтарое Тогда
			ПолноеНаименование = ДелопроизводствоКлиентСервер.АвтоЗаголовокДела(
				РеквизитыНоменклатурыДел.ПолноеНаименование, НомерТома, НомерЧасти);
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ПолноеНаименование) Тогда
		ПолноеНаименование = ДелопроизводствоКлиентСервер.АвтоЗаголовокДела(
			РеквизитыНоменклатурыДел.ПолноеНаименование, НомерТома, НомерЧасти);
	КонецЕсли;
	
	Наименование = Делопроизводство.НаименованиеДела(ЭтотОбъект);
	Организация = РеквизитыНоменклатурыДел.Организация;
	Подразделение = РеквизитыНоменклатурыДел.РазделПодразделение;
	ФормаДокументов = РеквизитыНоменклатурыДел.ФормаДокументов;
	
	ОтноситсяКНоменклатуреДел.Очистить();
	НоваяСтрока = ОтноситсяКНоменклатуреДел.Добавить();
	НоваяСтрока.НоменклатураДел = НоменклатураДел;
	
	МассивНоменклатурПоПериоду = Делопроизводство.ПолучитьМассивНоменклатурЗаПериод(
		НоменклатураДел, ДатаНачала, ДатаОкончания);
		
	Для Каждого Номенклатура Из МассивНоменклатурПоПериоду Цикл 
		НоваяСтрока = ОтноситсяКНоменклатуреДел.Добавить();
		НоваяСтрока.НоменклатураДел = Номенклатура;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ДелоЗакрыто = Ложь;
	КоличествоЛистов = 0;
	ДатаОкончания = '00010101';
	
	ОтноситсяКНоменклатуреДел.Очистить();
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Организация) Тогда 
		Организация = РаботаСОрганизациями.ПолучитьОрганизациюПоУмолчанию();
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ФормаДокументов) Тогда
		ФормаДокументов = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
			НоменклатураДел, "ФормаДокументов");
	КонецЕсли;
	
КонецПроцедуры

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
